[
    {
        "word": "potter",
        "synonym": "ceramist",
        "definition": "A person who makes pottery, especially by shaping clay and firing it in a kiln.",
        "example": "The local potter sells handmade mugs and bowls at the weekend market."
    },
    {
        "word": "vessel",
        "synonym": "container",
        "definition": "A hollow container, especially one used to hold liquids or for artistic purposes.",
        "example": "The ship was a large vessel carrying cargo across the Atlantic."
    },
    {
        "word": "smother",
        "synonym": "suffocate",
        "definition": "To cover or envelop completely, often in order to extinguish or suppress.",
        "example": "She tried to smother the fire with a heavy blanket."
    },
    {
        "word": "hue",
        "synonym": "shade",
        "definition": "A particular color or shade of a color.",
        "example": "The sunset painted the sky in a brilliant hue of orange and pink."
    },
    {
        "word": "etch",
        "synonym": "engrave",
        "definition": "To cut or carve a design, pattern, or text into a surface, usually for artistic or recording purposes.",
        "example": "The artist etched her initials into the metal plate."
    },
    {
        "word": "line drawing",
        "synonym": "sketch",
        "definition": "A drawing consisting of lines without shading or coloring, often used to show shape or outline.",
        "example": "He created a simple line drawing of the building before adding color."
    },
    {
        "word": "line",
        "synonym": "stroke",
        "definition": "A long, narrow mark or band, often drawn or visible on a surface.",
        "example": "She drew a straight line across the page with her ruler."
    },
    {
        "word": "foothill",
        "synonym": "hillside",
        "definition": "A low hill at the base of a mountain or mountain range.",
        "example": "They hiked up the foothill to get a better view of the valley below."
    },
    {
        "word": "marking",
        "synonym": "inscription",
        "definition": "A visible sign, symbol, or pattern on a surface, often for identification or decoration.",
        "example": "The turtle’s shell had unique markings that made it easy to identify."
    },
    {
        "word": "high-resolution",
        "synonym": "detailed",
        "definition": "Describing an image or display that has a very high level of detail or clarity.",
        "example": "The scientist examined high-resolution images of the cells under a microscope."
    },
    {
        "word": "phylum",
        "synonym": "division",
        "definition": "A principal taxonomic category that ranks above class and below kingdom, used to group organisms with a common basic structure.",
        "example": "Humans belong to the phylum Chordata, which includes all animals with a notochord."
    },
    {
        "word": "evergreen",
        "synonym": "perennial",
        "definition": "A plant that retains green leaves throughout the year instead of shedding them seasonally.",
        "example": "Pine trees are evergreen and keep their needles even in winter."
    },
    {
        "word": "year-round",
        "synonym": "all-season",
        "definition": "Continuing throughout the entire year; not limited to a specific season.",
        "example": "The park is open year-round for visitors to enjoy."
    },
    {
        "word": "larch tree",
        "synonym": "deciduous conifer",
        "definition": "A type of coniferous tree that loses its needles in autumn, unlike most conifers.",
        "example": "The larch tree turns golden before shedding its needles in the fall."
    },
    {
        "word": "needle",
        "synonym": "leaf",
        "definition": "A thin, pointed leaf of certain trees, such as pines, spruces, and firs.",
        "example": "The pine tree’s needles provide insulation against the cold."
    },
    {
        "word": "spatulae",
        "synonym": "flaps",
        "definition": "Small, flat structures, often at the tips of hairs or appendages, that help in attachment or spreading.",
        "example": "The gecko's spatulae at the tips of its toes allow it to stick to walls."
    },
    {
        "word": "cling",
        "synonym": "adhere",
        "definition": "To hold on tightly to something or stick closely to a surface.",
        "example": "The wet shirt clung to her skin after she got caught in the rain."
    },
    {
        "word": "straddle",
        "synonym": "bridge",
        "definition": "To exist or live across two different conditions, situations, or places at the same time.",
        "example": "She had to straddle two jobs to support her family while continuing her studies."
    },
    {
        "word": "oral history",
        "synonym": "testimonial",
        "definition": "A recorded account of personal experiences or events told by someone who witnessed or experienced them.",
        "example": "The museum collected oral histories from veterans to preserve their stories."
    },
    {
        "word": "subject",
        "synonym": "participant",
        "definition": "A person or individual being studied, observed, or documented in research.",
        "example": "The psychologist interviewed each subject about their daily habits."
    },
    {
        "word": "encompass",
        "synonym": "include",
        "definition": "To surround, contain, or cover something completely; to include a wide range or area.",
        "example": "The national park encompasses forests, lakes, and mountains within its boundaries."
    },
    {
        "word": "seek",
        "synonym": "consult",
        "definition": "To try to obtain, ask for, or look for something, such as advice, help, or information.",
        "example": "She sought guidance from her mentor before making a major career decision."
    },
    {
        "word": "slim",
        "synonym": "narrow",
        "definition": "To make something thinner or narrower in shape or size.",
        "example": "The designer slimmed the furniture legs to give the table a more elegant look."
    },
    {
        "word": "tilt out",
        "synonym": "angle",
        "definition": "To slant or lean something away from a vertical or horizontal position.",
        "example": "He tilted the painting out slightly to reduce glare from the lights."
    },
    {
        "word": "tilt",
        "synonym": "lean",
        "definition": "To cause to slope, slant, or lean in a particular direction.",
        "example": "The old bookshelf began to tilt after years of holding heavy books."
    },
    {
        "word": "score",
        "synonym": "sheet music",
        "definition": "A written representation of a musical composition, showing all the parts for performers.",
        "example": "The pianist studied the score carefully before the recital."
    },
    {
        "word": "vocal direction",
        "synonym": "singing instruction",
        "definition": "Instructions in a musical score that guide singers on how to perform certain passages, including style, dynamics, or expression.",
        "example": "The conductor gave clear vocal directions to help the choir sing in harmony."
    },
    {
        "word": "notation",
        "synonym": "musical symbols",
        "definition": "A system of written symbols used to represent music, sounds, or instructions for performance.",
        "example": "The composer wrote precise notation to indicate the rhythm and pitch of each instrument."
    },
    {
        "word": "typical",
        "synonym": "usual",
        "definition": "Representing what is normal or expected in a particular situation.",
        "example": "A typical day at school starts with morning announcements."
    },
    {
        "word": "surveyor",
        "synonym": "inspector",
        "definition": "A person who measures and examines land, structures, or sites to determine boundaries or layout.",
        "example": "The surveyor marked the property lines before construction began."
    },
    {
        "word": "grid",
        "synonym": "matrix",
        "definition": "A network of lines that cross each other to form squares, used for measurement or organization.",
        "example": "The city streets are laid out in a grid pattern for easy navigation."
    },
    {
        "word": "map onto",
        "synonym": "plot",
        "definition": "To record or assign something onto a specific layout or reference system.",
        "example": "The scientist mapped the sample locations onto the chart for analysis."
    }
]