[
    {
        "word": "Preface",
        "definition": "An introduction at the beginning of a book, usually written by the author, explaining the purpose or context of the book.",
        "example": "The preface of the novel explained why the author chose to write about his childhood."
    },
    {
        "word": "In doing so",
        "definition": "A phrase used to show that one action causes another or is connected to another.",
        "example": "She studied hard for her exams and, in doing so, improved her grades significantly."
    },
    {
        "word": "Deliberately",
        "definition": "Intentionally; done on purpose rather than by accident.",
        "example": "He deliberately left the meeting early to avoid answering difficult questions."
    },
    {
        "word": "By choice",
        "definition": "Voluntarily; because someone has decided to, not because they were forced.",
        "example": "She lives in the countryside by choice, even though the city offers more opportunities."
    },
    {
        "word": "By default",
        "definition": "Automatically; happening because no alternative was chosen.",
        "example": "He became the team leader by default because no one else volunteered."
    },
    {
        "word": "Distill",
        "definition": "To extract the essential meaning or most important part of something.",
        "example": "The teacher tried to distill the complex theory into a few simple points."
    },
    {
        "word": "Set about",
        "definition": "To begin doing something, usually with a plan or purpose.",
        "example": "She set about organizing her notes for the big presentation."
    },
    {
        "word": "Compile",
        "definition": "To collect information or items from various sources and put them together.",
        "example": "He compiled a list of the best restaurants in the city for his blog."
    },
    {
        "word": "Heartfelt",
        "definition": "Sincere and deeply felt; showing genuine emotion.",
        "example": "She gave a heartfelt speech thanking everyone for their support."
    },
    {
        "word": "In the high hope",
        "definition": "With strong optimism or expectation that something good will happen.",
        "example": "He wrote the letter in the high hope that it would reach the right person."
    },
    {
        "word": "Act on",
        "definition": "To take action based on advice, information, or knowledge.",
        "example": "If you want to improve your health, you must act on the doctor’s recommendations."
    },
    {
        "word": "Trial",
        "definition": "A test, challenge, or difficult experience.",
        "example": "She faced many trials before finally achieving her dream of becoming a doctor."
    },
    {
        "word": "Enrich",
        "definition": "To improve or enhance the quality, value, or meaning of something.",
        "example": "Traveling can enrich your understanding of different cultures."
    },
    {
        "word": "Prosperity",
        "definition": "Success, wealth, or good fortune, often both financial and personal.",
        "example": "Hard work and determination can lead to prosperity in life."
    },
    {
        "word": "rejoice",
        "definition": "To feel or show great joy or happiness.",
        "example": "When she received the award, she could not help but rejoice with her friends."
    },
    {
        "word": "missile",
        "definition": "A weapon that is launched and can travel through the air to hit a target, often used in military contexts.",
        "example": "The country tested a new missile that could reach targets hundreds of miles away."
    },
    {
        "word": "pinpoint",
        "definition": "To locate or identify something with great accuracy.",
        "example": "Scientists were able to pinpoint the source of the earthquake."
    },
    {
        "word": "keep a date with",
        "definition": "To attend an appointment, meeting, or scheduled time with someone.",
        "example": "I promised to keep a date with my teacher at 3 p.m. to discuss my project."
    },
    {
        "word": "fax machine",
        "definition": "A device that sends printed documents over a telephone line.",
        "example": "Before email became popular, the office relied on a fax machine to send contracts quickly."
    },
    {
        "word": "have the privilege to",
        "definition": "To have the special right or honor to do something.",
        "example": "I have the privilege to meet the president during the ceremony."
    },
    {
        "word": "slip into",
        "definition": "To move or pass into something gradually or without notice.",
        "example": "Days slip into weeks when you are busy with work."
    },
    {
        "word": "deathbed",
        "definition": "The bed on which someone is dying; used figuratively to refer to the last moments of life.",
        "example": "On his deathbed, he told his children how much he loved them."
    },
    {
        "word": "sigh",
        "definition": "A long, deep breath expressing relief, sadness, or tiredness.",
        "example": "She let out a sigh after finishing the difficult exam."
    },
    {
        "word": "keynote",
        "definition": "The main or central speech at a conference or event.",
        "example": "The CEO delivered the keynote at the annual business conference."
    },
    {
        "word": "leadership",
        "definition": "The ability to guide, direct, or inspire others.",
        "example": "Her leadership skills helped the team complete the project ahead of schedule."
    },
    {
        "word": "insight",
        "definition": "A deep understanding of a person, situation, or concept.",
        "example": "His book provides valuable insight into human behavior."
    },
    {
        "word": "invariably",
        "definition": "Always; without change.",
        "example": "He invariably arrives at work before 8 a.m."
    },
    {
        "word": "center on",
        "definition": "To focus primarily on something.",
        "example": "The discussion centered on ways to improve education."
    },
    {
        "word": "simplify",
        "definition": "To make something easier or less complicated.",
        "example": "We need to simplify the instructions so everyone can understand."
    },
    {
        "word": "calling",
        "definition": "A strong inner impulse toward a particular career or purpose in life.",
        "example": "She felt a calling to become a teacher and help children learn."
    },
    {
        "word": "worthy",
        "definition": "Deserving respect, attention, or effort.",
        "example": "He made a worthy contribution to the charity."
    },
    {
        "word": "noble",
        "definition": "Having high moral qualities or ideals.",
        "example": "She pursued a noble goal of helping the poor."
    },
    {
        "word": "objective",
        "definition": "A goal or purpose someone aims to achieve.",
        "example": "The main objective of the project is to reduce pollution."
    },
    {
        "word": "manifest",
        "definition": "To show or demonstrate something clearly.",
        "example": "His dedication manifested in the way he helped everyone in the team."
    },
    {
        "word": "sum up",
        "definition": "To briefly state the main points or essence of something.",
        "example": "He tried to sum up the meeting in a few sentences."
    },
    {
        "word": "all too often",
        "definition": "Used to say that something happens frequently, usually in a negative sense.",
        "example": "All too often, people ignore small problems until they become big issues."
    },
    {
        "word": "grand",
        "definition": "Impressive, large, or significant in scale or importance.",
        "example": "They stayed in a grand hotel overlooking the ocean."
    },
    {
        "word": "feat",
        "definition": "An achievement that requires skill, courage, or effort.",
        "example": "Climbing Mount Everest is a remarkable feat."
    },
    {
        "word": "decency",
        "definition": "Behavior that is morally good, polite, and considerate.",
        "example": "He showed decency by helping the elderly woman cross the street."
    },
    {
        "word": "over the course of",
        "definition": "During the duration of a period of time.",
        "example": "Over the course of the year, she learned three new languages."
    },
    {
        "word": "compassion",
        "definition": "Sympathetic concern for the suffering or misfortune of others.",
        "example": "Volunteers showed great compassion to the victims of the flood."
    },
    {
        "word": "courtesy",
        "definition": "Polite behavior and respect toward others.",
        "example": "He thanked the driver out of courtesy."
    },
    {
        "word": "worthwhile",
        "definition": "Valuable or meaningful; worth the time or effort.",
        "example": "Volunteering at the shelter was a worthwhile experience."
    },
    {
        "word": "toll",
        "definition": "A metaphorical cost or price that must be paid.",
        "example": "Years of stress took a toll on his health."
    },
    {
        "word": "tithe",
        "definition": "A gift, often financial, given as a contribution, typically as a sign of gratitude or support.",
        "example": "They decided to tithe 10% of their income to charity."
    },
    {
        "word": "have a practice of",
        "definition": "To routinely or habitually do something; to make a habit of doing something regularly.",
        "example": "He has a practice of sending thank-you emails after every meeting."
    },
    {
        "word": "enclosed",
        "definition": "Included inside something, usually a letter or package.",
        "example": "Please find the documents enclosed in this envelope."
    },
    {
        "word": "blessing",
        "definition": "A prayer, expression of approval, or good wish for someone.",
        "example": "They asked for the priest’s blessing before the journey."
    },
    {
        "word": "gratitude",
        "definition": "The feeling of thankfulness or appreciation.",
        "example": "She sent a card to express her gratitude for the help she received."
    },
    {
        "word": "gesture",
        "definition": "An action performed to       express a feeling or intention.",
        "example": "He gave her a flower as a kind gesture."
    },
    {
        "word": "wheel into",
        "definition": "To move something, usually a person in a wheelchair or a large object, into a place.",
        "example": "The patient was wheeled into the hospital room."
    },
    {
        "word": "delight",
        "definition": "To make someone very happy or give them great pleasure.",
        "example": "He would delight his friend with stories of the outside world."
    },
    {
        "word": "bedridden",
        "definition": "Confined to a bed because of illness or injury.",
        "example": "The bedridden man could not see outside, so he relied on his friend’s stories."
    },
    {
        "word": "companion",
        "definition": "A person who spends time with or stays with someone; a friend or partner.",
        "example": "His only companion in the hospital was the man next to the window."
    },
    {
        "word": "wonder",
        "definition": "A feeling of amazement or admiration; something very surprising or beautiful.",
        "example": "The man could not see the wonders his friend described."
    },
    {
        "word": "coughing fit",
        "definition": "A sudden period of repeated coughing.",
        "example": "During a coughing fit, he stopped breathing."
    },
    {
        "word": "wheel out",
        "definition": "To move someone or something out of a place using a wheeled device.",
        "example": "The dead patient was wheeled out of the room."
    },
    {
        "word": "recount",
        "definition": "To tell someone about something, usually a story or event.",
        "example": "He would recount the sights outside the window in detail."
    },
    {
        "word": "sight",
        "definition": "Something that is seen or can be seen; a view.",
        "example": "The man shared the beautiful sights of the park with his friend."
    },
    {
        "word": "comply (with)",
        "definition": "To act according to a rule, request, or command.",
        "example": "The nurse complied with the patient’s request to move his bed."
    },
    {
        "word": "attending",
        "definition": "Being present and taking care of someone, especially in a hospital.",
        "example": "The attending nurse moved his bed next to the window."
    },
    {
        "word": "make shake",
        "definition": "To cause someone to tremble or be very surprised or scared.",
        "example": "The view outside the window made him shake with shock."
    },
    {
        "word": "stark",
        "definition": "Very plain, empty, or harsh in appearance.",
        "example": "The window faced a stark brick wall, not the park."
    },
    {
        "word": "conjure up",
        "definition": "To make someone imagine or think of something, especially something that is not really there.",
        "example": "He conjured up beautiful scenes to comfort his friend."
    },
    {
        "word": "selfless",
        "definition": "Concerned more with the needs and wishes of others than with one’s own.",
        "example": "His actions were selfless, done purely out of love."
    },
    {
        "word": "in the overall scheme of",
        "definition": "Considering the bigger picture or the entire situation.",
        "example": "In the overall scheme of things, our problems are small."
    },
    {
        "word": "blip on",
        "definition": "A very small, temporary, or insignificant event in a larger context.",
        "example": "Our lives are just a blip on the canvas of eternity."
    },
    {
        "word": "canvas",
        "definition": "A surface for painting; here it means the 'whole picture' of life or existence.",
        "example": "Our lives are mere blips on the canvas of eternity."
    },
    {
        "word": "eternity",
        "definition": "Infinite or unending time.",
        "example": "Life is short, but the universe goes on for eternity."
    },
    {
        "word": "savor",
        "definition": "To enjoy something completely, especially an experience or moment.",
        "example": "We should savor the journey of life, not just the destination."
    }
]